# iM DiGItal Banker Academy
## 데이터분석 전문가 양성 과정 4기
[데이터 분석을 위한 파이썬 및 통계 응용 코딩] 중간 평가 안내

### 안내사항
* 평가 중 ```ChatGPT 사용은 금지```됩니다.
* 인터넷 검색은 불가하며, 단 강의 노트 및 교재는 참고하실 수 있습니다.
* 평가 시간은 오후 1시30분부터 오후 4시까지입니다.
* 제출하는 코드에는 반드시 실행 결과가 출력되어야 합니다.
* 평가 완료 후, 코드를 ipynb 파일로 저장하고 파일명에 ```[이름]``` 부분 안에 이름을 지우고 반드시 본인의 성명을 기입하여 제출해 주시기 바랍니다.
* 문제당 4점이며 부분점수는 없습니다.
* 시험 결과 공개 후 이의제기가 가능하며, 타당할 시 추가 점수 부여 가능합니다.

In [437]:
import pandas as pd
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")
import scipy.stats as stats
import matplotlib.pyplot as plt
import numpy as np
from scipy.stats import binom

1. 파이썬을 이용하여 "Hello, Python!" 을 출력하는 프로그램을 작성하세요.

In [440]:
print('Hello, Python!')

Hello, Python!

2. 변수 a에 5, b에 10을 할당하고 두 변수의 합을 출력하는 프로그램을 작성하세요.

In [443]:
a = 5
b = 10

print(a+b)

15

3. 사용자로부터 정수를 입력받아 해당 숫자가 짝수이면 "짝수", 홀수이면 "홀수"를 출력하는 프로그램을 작성하세요.

In [543]:
n = int(input("입력: "))

if n % 2 == 0:
    print('짝수')
else:
    print('홀수')

입력:  4

짝수

4. 리스트 [1, 2, 3, 4, 5]의 각 요소를 하나씩 출력하는 프로그램을 작성하세요.

In [469]:
a = [1, 2, 3, 4, 5]

for i in a:
    print(i)

1
2
3
4
5

5. 두 수를 인자로 받아 곱한 결과를 반환하는 함수를 정의하고, 예시로 4와 5의 곱을 출력하는 프로그램을 작성하세요.

In [472]:
a = int(input('첫번째 수 : '))
b = int(input('두번째 수 : '))

def multiply(a, b):
    return a * b

print(multiply(a, b))

첫번째 수 :  4
두번째 수 :  5

20

6. 딕셔너리 fruits에 "apple": 3, "banana": 5, "orange": 2의 값을 저장한 후, "banana"의 값을 출력하는 프로그램을 작성하세요.

In [474]:
fruits = {'apple' : 3, 'banana' : 5, 'orange' : 2}

print(fruits['banana'])

5

7. while문을 사용하여 1부터 5까지의 숫자를 출력하는 프로그램을 작성하세요.

In [477]:
num = 1

while num <= 5:
    print(num)
    num += 1

1
2
3
4
5

8. Seaborn의 tips 데이터셋을 불러와서 첫 5개 행을 출력하는 코드를 작성하세요.

In [480]:
df = sns.load_dataset('tips')
df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

9. tips 데이터셋의 수치형 변수들에 대해 평균, 표준편차, 최소값, 사분위수 등을 포함한 기본 통계량을 출력하세요.

In [483]:
df2 = df[['total_bill', 'tip', 'size']]
df2.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

10. tips 데이터셋에서 팁(tip) 열의 평균 값을 계산하여 출력하는 코드를 작성하세요.

In [486]:
df['tip'].mean()

2.99827868852459

11. tips 데이터셋을 요일(day)별로 그룹화한 후, 각 요일의 총 계산 금액(total_bill) 평균을 계산하여 출력하세요.

In [489]:
df.groupby('day')['total_bill'].mean()

day
Thur    17.682742
Fri     17.151579
Sat     20.441379
Sun     21.410000
Name: total_bill, dtype: float64

12. tips 데이터셋에서 성별(sex)별로 팁을 가장 많이 낸 행을 출력하세요.

In [492]:
female_max = df[df['sex'] == 'Female']['tip'].idxmax()
male_max = df[df['sex'] == 'Male']['tip'].idxmax()

df.loc[[female_max, male_max]]

     total_bill   tip     sex smoker  day    time  size
214       28.17   6.5  Female    Yes  Sat  Dinner     3
170       50.81  10.0    Male    Yes  Sat  Dinner     3

13. tips 데이터셋에 tip_percentage라는 새 열을 추가하여, 각 행의 팁 비율(팁/총 계산 금액 * 100)을 계산한 후 팁 비율이 가장 높은 상위 5개 행을 출력하세요.

In [495]:
df['tip_percentage'] = df['tip']/df['total_bill']*100
df.sort_values('tip_percentage', ascending=False).head(5)

     total_bill   tip     sex smoker  day    time  size  tip_percentage
172        7.25  5.15    Male    Yes  Sun  Dinner     2       71.034483
178        9.60  4.00  Female    Yes  Sun  Dinner     2       41.666667
67         3.07  1.00  Female    Yes  Sat  Dinner     1       32.573290
232       11.61  3.39    Male     No  Sat  Dinner     2       29.198966
183       23.17  6.50    Male    Yes  Sun  Dinner     4       28.053517

14. tips 데이터셋에서 팁(tip) 값이 5보다 큰 행들만 필터링하여 출력하는 코드를 작성하세요.

In [498]:
df[df['tip'] > 5]

     total_bill    tip     sex smoker   day    time  size  tip_percentage
23        39.42   7.58    Male     No   Sat  Dinner     4       19.228818
44        30.40   5.60    Male     No   Sun  Dinner     4       18.421053
47        32.40   6.00    Male     No   Sun  Dinner     4       18.518519
52        34.81   5.20  Female     No   Sun  Dinner     4       14.938236
59        48.27   6.73    Male     No   Sat  Dinner     4       13.942407
85        34.83   5.17  Female     No  Thur   Lunch     4       14.843526
88        24.71   5.85    Male     No  Thur   Lunch     2       23.674626
116       29.93   5.07    Male     No   Sun  Dinner     4       16.939526
141       34.30   6.70    Male     No  Thur   Lunch     6       19.533528
155       29.85   5.14  Female     No   Sun  Dinner     5       17.219430
170       50.81  10.00    Male    Yes   Sat  Dinner     3       19.681165
172        7.25   5.15    Male    Yes   Sun  Dinner     2       71.034483
181       23.33   5.65    Male    Yes   Sun  Dinner     2       24.217745
183       23.17   6.50    Male    Yes   Sun  Dinner     4       28.053517
211       25.89   5.16    Male    Yes   Sat  Dinner     4       19.930475
212       48.33   9.00    Male     No   Sat  Dinner     4       18.621974
214       28.17   6.50  Female    Yes   Sat  Dinner     3       23.074192
239       29.03   5.92    Male     No   Sat  Dinner     3       20.392697

15. tips 데이터셋을 요일(day)과 식사 시간(time, Lunch/Dinner)별로 그룹화하여 각 그룹의 평균 팁(tip) 값을 계산하고 출력하는 코드를 작성하세요.

In [501]:
df.groupby(['day', 'time'])['tip'].mean().to_frame()

                  tip
day  time
Thur Lunch   2.767705
     Dinner  3.000000
Fri  Lunch   2.382857
     Dinner  2.940000
Sat  Lunch        NaN
     Dinner  2.993103
Sun  Lunch        NaN
     Dinner  3.255132

16. tips 데이터셋을 사용하여, 요일(day)을 인덱스로, 식사 시간(time)을 열로 하는 피벗 테이블을 작성하고, 각 셀에는 해당 그룹의 평균 팁(tip)이 들어가도록 하세요.

In [504]:
df.pivot_table(index = 'day', columns='time', values='tip', aggfunc='mean')

time     Lunch    Dinner
day
Thur  2.767705  3.000000
Fri   2.382857  2.940000
Sat        NaN  2.993103
Sun        NaN  3.255132

17. 아래 DataFrame에서 'Region'을 인덱스로, 'Product'를 열로 하여 'Sales' 값의 합계를 계산하는 pivot table을 작성하세요.

In [507]:
df = pd.DataFrame({
    'Region': ['North', 'South', 'North', 'South', 'North'],
    'Product': ['A', 'A', 'B', 'B', 'A'],
    'Sales': [100, 200, 150, 300, 120]
})

df.pivot_table(index='Region', columns='Product', values='Sales', aggfunc='sum')

Product    A    B
Region
North    220  150
South    200  300

18. 아래 DataFrame을 사용하여, 'Region'과 'Product'를 기준으로 'Sales'의 합계와 평균을 동시에 계산하는 pivot table을 작성하세요.

In [510]:
df = pd.DataFrame({
    'Region': ['East', 'West', 'East', 'West', 'East', 'West'],
    'Product': ['C', 'C', 'D', 'D', 'C', 'D'],
    'Sales': [250, 150, 300, 400, 350, 200]
})

df.pivot_table(index='Region', columns='Product', values='Sales', aggfunc=['sum', 'mean'])

         sum        mean
Product    C    D      C      D
Region
East     600  300  300.0  300.0
West     150  600  150.0  300.0

19. 아래 DataFrame에서 'Category'와 'Type'을 기준으로 'Value'의 합계를 계산하는 pivot table을 작성한 후, 결과에 포함된 NaN 값을 0으로 대체하는 코드를 작성하세요.

In [513]:
df = pd.DataFrame({
    'Category': ['X', 'X', 'Y', 'Y', 'Z'],
    'Type': ['A', 'B', 'A', 'B', 'A'],
    'Value': [10, 20, 30, 40, 50]
})

df.pivot_table(index = 'Category', columns='Type', values='Value', aggfunc='sum', fill_value=0)

Type       A   B
Category
X         10  20
Y         30  40
Z         50   0

20. 아래 DataFrame에서 'id' 열을 식별자로 하고, 나머지 점수 열('score1', 'score2', 'score3')을 하나의 변수 열로 변환하는 melt 코드를 작성하세요. 그리고 melt로 변환한 결과 DataFrame에서, 기본 열 이름인 'variable'과 'value'를 각각 'Subject'와 'Score'로 변경하여 출력하는 코드를 작성하세요.

In [516]:
df = pd.DataFrame({
    'id': [1, 2, 3],
    'score1': [80, 85, 90],
    'score2': [70, 75, 80],
    'score3': [60, 65, 70]
})

pd.melt(df, id_vars='id', var_name='Subject', value_name='Score')

   id Subject  Score
0   1  score1     80
1   2  score1     85
2   3  score1     90
3   1  score2     70
4   2  score2     75
5   3  score2     80
6   1  score3     60
7   2  score3     65
8   3  score3     70

21. 한 커피 제조회사는 새로 출시한 커피가 카페인 함량이 평균 95 미만이라고 주장하고 있습니다. 커피 제조회사의 주장이 타당하지 검정하세요.  
(유의수준 0.05)

* 귀무가설 : 카페인 함량이 평균 95mg 보다 같거나 크다.
* 대립가설 : 카페인 함량이 평균 95mg 보다 작다.

In [519]:
df = pd.DataFrame({
    'Caffeine(mg)': [
        94.2, 93.7, 95.5, 93.9, 94.0, 95.2, 94.7, 93.5, 92.8, 94.4,
        93.8, 94.6, 93.3, 95.1, 94.3, 94.9, 93.9, 94.8, 95.0, 94.2,
        93.7, 94.4, 95.1, 94.0, 93.6
    ]
})

# 정규성
print(stats.shapiro(df))

# t-검정
print(stats.ttest_1samp(df, 95, alternative='less'))

ShapiroResult(statistic=0.9826578166170533, pvalue=0.9322031137746914)
TtestResult(statistic=array([-5.50173704]), pvalue=array([5.86865539e-06]), df=array([24]))

22. 스마트폰 사용자 집단을 두 그룹으로 나누어 한 그룹에는 새로운 충전기, 다른 그룹에는 기존 충전기를 제공하고 두 그룹의 평균 충전 시간을 비교했다. 새로운 충전기가 더 빠르다고 할 수 있는지 검정하세요.  
(유의수준 0.05)

In [522]:
df = pd.DataFrame({
    '충전기': ['New'] * 10 + ['Old'] * 10,
    '충전시간': [
        1.5, 1.6, 1.4, 1.7, 1.5, 1.6, 1.7, 1.4, 1.6, 1.5,
        1.7, 1.8, 1.7, 1.9, 1.8, 1.7, 1.8, 1.9, 1.7, 1.6
    ]
})

new = [1.5, 1.6, 1.4, 1.7, 1.5, 1.6, 1.7, 1.4, 1.6, 1.5]
old = [1.7, 1.8, 1.7, 1.9, 1.8, 1.7, 1.8, 1.9, 1.7, 1.6]

# 정규성 검증
print(stats.shapiro(new))
print(stats.shapiro(old))

# 분산 검증
print(stats.levene(new, old))

# 둘다 같으니 True 
print(stats.ttest_ind(new, old, equal_var = True, alternative = 'less'))

ShapiroResult(statistic=0.9065684572704982, pvalue=0.25824165549017347)
ShapiroResult(statistic=0.9044355911726943, pvalue=0.2449121806027384)
LeveneResult(statistic=0.20000000000000173, pvalue=0.6600556531895849)
TtestResult(statistic=-4.582575694955849, pvalue=0.00011546547787696304, df=18.0)

23. 새로 개발한 교육과정에 참여하면 학습 시간이 단축된다고 주장한다. 기존 교육 방법과 새로운 교육 방법을 적용한 결과에 대해 새로운 교육 방법이 교육 시간을 단축시키는지 검정하세요. 모집단은 정규 분포를 따른다고 가정합니다.  
(유의수준 0.05)

In [525]:
df = pd.DataFrame({
    'User': list(range(1, 11)),
    '기존방법': [60.4, 60.7, 60.5, 60.3, 60.8, 60.6, 60.2, 60.5, 60.7, 60.4],
    '새로운방법': [59.8, 60.2, 60.1, 59.9, 59.7, 58.4, 57.0, 60.3, 59.6, 59.8]
})

print(stats.ttest_rel(df['새로운방법'], df['기존방법'], alternative='less'))

TtestResult(statistic=-3.407973078114844, pvalue=0.0038872633380070652, df=9)

24. 각 캠프의 세미나 등록 여부를 조사한 결과는 아래와 같다. 캠프와 세미나 등록 여부가 서로 독립적인지 검정하세요.  
(유의수준 0.05)

In [528]:
df = pd.DataFrame({
        '캠프': ['빅분기']*80 + ['정처기']*100,
        '등록여부': ['등록']*50 + ['등록안함']*30 + ['등록']*60 + ['등록안함']*40
})

df2 = pd.DataFrame({
    '등록' : [50, 60],
    '등록안함' : [30 ,40]
}, index=['빅분기', '정처기'])

stats.chi2_contingency(df2)

Chi2ContingencyResult(statistic=0.03535714285714309, pvalue=0.8508492527705047, dof=1, expected_freq=array([[48.88888889, 31.11111111],
       [61.11111111, 38.88888889]]))

25. 하루 동안 받는 이메일 중 스팸 이메일이 도착할 확률이 0.1라고 가정합니다. 하루에 총 50개의 이메일을 받는다고 할 때, 스팸 이메일이 10개 이상으로 도착할 누적 확률을 계산하세요.

In [531]:
n = 50
p = 0.1

print(1 - binom.cdf(9, n, p))

0.024537935704591396